STMicroelectronics/STM32CubeWL/Projects/B-WL5M-SUBG1/Applications/LoRaWAN_FUOTA_DualCore_ExtFlash/LoRaWAN_End_Node_DualCore/CM0PLUS/MbMux/LmHandler_mbwrapper.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    LmHandler_mbwrapper.c
  * @author  MCD Application Team
  * @brief   This file implements the CM0PLUS side wrapper of the LoraMac interface
  *          shared between M0 and M4.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "stm32_mem.h"
#include "mbmux_table.h"
#include "msg_id.h"
#include "mbmux.h"
#include "mbmuxif_lora.h"
#include "sys_app.h"
#include "lora_app.h"

#include "LmHandler_mbwrapper.h"
#include "LmHandler.h"
#include "lora_info.h"
#include "app_version.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* External variables ---------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private typedef -----------------------------------------------------------*/
/*!
 * LoRa State Machine states
 */
typedef enum TxEventType_e
{
  /*!
   * @brief Appdata Transmission issue based on timer every TxDutyCycleTime
   */
  TX_ON_TIMER,
  /*!
   * @brief Appdata Transmission external event plugged on OnSendEvent( )
   */
  TX_ON_EVENT
} TxEventType_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
#ifndef MAX
#define MAX( a, b ) ( ( ( a ) > ( b ) ) ? ( a ) : ( b ) )
#endif /* MAX */
#ifndef ALIGN_X
#define ALIGN_X( operand, alignment ) ( ((operand + (alignment - 1)) & ~(alignment - 1)) )
#endif /* ALIGN_X */
#define LMH_ON_JOIN_SIZE (ALIGN_X(sizeof(LmHandlerJoinParams_t), 8) + (sizeof(CommissioningParams_t)))
#define LMH_ON_TX_SIZE   (ALIGN_X(sizeof(LmHandlerTxParams_t), 8) + (sizeof(CommissioningParams_t)))
#define LMH_ON_RX_SIZE   (ALIGN_X(sizeof(LmHandlerAppData_t), 8)\
                          + 256 + ALIGN_X(sizeof(LmHandlerRxParams_t), 8) + (sizeof(CommissioningParams_t)))
#define LORA_MBWRAP_SHBUF_SIZE MAX(LMH_ON_JOIN_SIZE, MAX(LMH_ON_TX_SIZE, LMH_ON_RX_SIZE))

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static uint8_t GetBatteryLevel_mbwrapper(void);

static int16_t GetTemperatureLevel_mbwrapper(void);

static void OnRestoreContextRequest_mbwrapper(void *nvm, uint32_t nvm_size);

static void OnStoreContextRequest_mbwrapper(void *nvm, uint32_t nvm_size);

static void OnNvmDataChange_mbwrapper(LmHandlerNvmContextStates_t state);

static void OnNetworkParametersChange_mbwrapper(CommissioningParams_t *params);

static void OnJoinRequest_mbwrapper(LmHandlerJoinParams_t *joinParams);

static void OnTxData_mbwrapper(LmHandlerTxParams_t *params);

static void OnRxData_mbwrapper(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params);

static void OnClassChange_mbwrapper(DeviceClass_t deviceClass);

static void OnBeaconStatusChange_mbwrapper(LmHandlerBeaconParams_t *params);

static void OnSysTimeUpdate_mbwrapper(void);

static void OnTxPeriodicityChanged_mbwrapper(uint32_t periodicity);

static void OnTxFrameCtrlChanged_mbwrapper(LmHandlerMsgTypes_t isTxConfirmed);

static void OnPingSlotPeriodicityChanged_mbwrapper(uint8_t pingSlotPeriodicity);

static void OnSystemReset_mbwrapper(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
/**
  * @brief LmHandler buffer to exchange data between from CM0+ to CM4
  */
UTIL_MEM_PLACE_IN_SECTION("MB_MEM3") uint8_t aLoraMbWrapShare2Buffer[LORA_MBWRAP_SHBUF_SIZE];

/**
  * @brief local structure of LmHandler callbacks for notification processes
  */
static LmHandlerCallbacks_t callback_mbwrapper =
{
  .GetBatteryLevel =              GetBatteryLevel_mbwrapper,
  .GetTemperature =               GetTemperatureLevel_mbwrapper,
  .GetUniqueId =                  GetUniqueId,
  .GetDevAddr =                   GetDevAddr,
  .OnRestoreContextRequest =      OnRestoreContextRequest_mbwrapper,
  .OnStoreContextRequest =        OnStoreContextRequest_mbwrapper,
  .OnMacProcess =                 OnMacProcessNotify,
  .OnNvmDataChange =              OnNvmDataChange_mbwrapper,
  .OnNetworkParametersChange =    OnNetworkParametersChange_mbwrapper,
  .OnJoinRequest =                OnJoinRequest_mbwrapper,
  .OnTxData =                     OnTxData_mbwrapper,
  .OnRxData =                     OnRxData_mbwrapper,
  .OnClassChange =                OnClassChange_mbwrapper,
  .OnBeaconStatusChange =         OnBeaconStatusChange_mbwrapper,
  .OnSysTimeUpdate =              OnSysTimeUpdate_mbwrapper,
  .OnTxPeriodicityChanged =       OnTxPeriodicityChanged_mbwrapper,
  .OnTxFrameCtrlChanged =         OnTxFrameCtrlChanged_mbwrapper,
  .OnPingSlotPeriodicityChanged = OnPingSlotPeriodicityChanged_mbwrapper,
  .OnSystemReset =                OnSystemReset_mbwrapper
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Exported functions ---------------------------------------------------------*/
void Process_Lora_Cmd(MBMUX_ComParam_t *ComObj)
{
  /* USER CODE BEGIN Process_Lora_Cmd_1 */

  /* USER CODE END Process_Lora_Cmd_1 */
  uint32_t *com_buffer = NULL;
  LmHandlerErrorStatus_t errorStatus;
  bool busyStatus;

  APP_LOG(TS_ON, VLEVEL_H, ">CM0PLUS(LoRa)\r\n");

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(ComObj->ParamBuf, ComObj->BufSize);

  /* process Command */
  switch (ComObj->MsgId)
  {
    case   LMHANDLER_INIT_ID:
      errorStatus = LmHandlerInit(&callback_mbwrapper, APP_VERSION);

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      InitPackageProcess();
      break;

    case   LMHANDLER_DEINIT_ID:
      errorStatus = LmHandlerDeInit();

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;

