STMicroelectronics/STM32CubeWL/Projects/B-WL5M-SUBG1/Applications/LoRaWAN_FUOTA_DualCore_ExtFlash/LoRaWAN_End_Node_DualCore/CM0PLUS/MbMux/LmHandler_mbwrapper.c
    case   LMHANDLER_CONFIGURE_ID:
      errorStatus = LmHandlerConfigure((LmHandlerParams_t *) com_buffer[0]);

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;

    case   LMHANDLER_JOIN_STATUS_ID:
    {
      LmHandlerFlagStatus_t flagStatus = LmHandlerJoinStatus();

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) flagStatus; /* */
    }
    break;

    case   LMHANDLER_JOIN_ID:
      LmHandlerJoin((ActivationType_t) com_buffer[0], (bool) com_buffer[1]);

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = 0; /* */
      break;

    case   LMHANDLER_STOP_ID:
      errorStatus = LmHandlerStop();

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;

    case   LMHANDLER_HALT_ID:
      errorStatus = LmHandlerHalt();

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;

    case   LMHANDLER_IS_BUSY_ID:
      busyStatus = LmHandlerIsBusy();

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (bool) busyStatus; /* */
      break;

    case   LMHANDLER_SEND_ID:
    {
      LmHandlerAppData_t appData;
      appData.Port = (uint8_t)com_buffer[0];
      appData.BufferSize = (uint8_t)com_buffer[1];
      appData.Buffer = (uint8_t *)com_buffer[2];

      errorStatus = LmHandlerSend(&appData, (LmHandlerMsgTypes_t) com_buffer[3], (bool)com_buffer[4]);

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
    }
    break;
    case   LMHANDLER_PROCESS_ID:
      LmHandlerProcess();

      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = 0; /* */
      break;
    case   LMHANDLER_GET_DUTY_CYCLE_TIME_ID:
    {
      TimerTime_t dutyCycleWaitTime;
      dutyCycleWaitTime = LmHandlerGetDutyCycleWaitTime();
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) dutyCycleWaitTime; /* */
    }
    break;

    case LMHANDLER_DEVICE_TIME_REQ_ID:
      errorStatus = LmHandlerDeviceTimeReq();
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;
    case LMHANDLER_GET_VERSION_ID:
      errorStatus = LmHandlerGetVersion((LmHandlerVersionType_t)com_buffer[0], (uint32_t *) com_buffer[1]);
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;
    case LMHANDLER_NVM_DATA_STORE_ID:
      errorStatus = LmHandlerNvmDataStore();
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = (uint32_t) errorStatus; /* */
      break;
    case   LMHANDLER_INFO_INIT_ID:
      LoraInfo_Init();
      /* prepare response buffer */
      ComObj->ParamCnt = 0; /* reset ParamCnt */
      ComObj->ReturnVal = 0; /* */
      break;

    default:
      break;
  }

  /* send Response */
  APP_LOG(TS_ON, VLEVEL_H, "<CM0PLUS(LoRa)\r\n");
  MBMUX_ResponseSnd(FEAT_INFO_LORAWAN_ID);
  /* USER CODE BEGIN Process_Lora_Cmd_2 */

  /* USER CODE END Process_Lora_Cmd_2 */
}

/* USER CODE BEGIN EF */

/* USER CODE END EF */

/* Private Functions Definition -----------------------------------------------*/
/*!
 * \brief   Measures the battery level
 *
 * \retval  Battery level [0: node is connected to an external
 *          power source, 1..254: battery level, where 1 is the minimum
 *          and 254 is the maximum value, 255: the node was not able
 *          to measure the battery level]
 */

static uint8_t GetBatteryLevel_mbwrapper(void)
{
  /* USER CODE BEGIN GetBatteryLevel_mbwrapper_1 */

  /* USER CODE END GetBatteryLevel_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_GET_BATTERY_LEVEL_CB_ID;
  com_obj->ParamCnt = 0;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return (uint8_t) com_obj->ReturnVal;
  /* USER CODE BEGIN GetBatteryLevel_mbwrapper_2 */

  /* USER CODE END GetBatteryLevel_mbwrapper_2 */
}

/*!
 * \brief   Measures the temperature level
 *
 * \retval  Temperature level
 */
static int16_t GetTemperatureLevel_mbwrapper(void)
{
  /* USER CODE BEGIN GetTemperatureLevel_mbwrapper_1 */

  /* USER CODE END GetTemperatureLevel_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_GET_TEMPERATURE_CB_ID;
  com_obj->ParamCnt = 0;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return (int16_t) com_obj->ReturnVal;
  /* USER CODE BEGIN GetTemperatureLevel_mbwrapper_2 */

  /* USER CODE END GetTemperatureLevel_mbwrapper_2 */
}

static void OnRestoreContextRequest_mbwrapper(void *nvm, uint32_t nvm_size)
{
  /* USER CODE BEGIN OnRestoreContextRequest_mbwrapper_1 */

  /* USER CODE END OnRestoreContextRequest_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_RESTORE_CONTEXT_REQ_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = (uint32_t)nvm;
  com_buffer[1] = nvm_size;
  com_obj->ParamCnt = 2;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnRestoreContextRequest_mbwrapper_2 */

  /* USER CODE END OnRestoreContextRequest_mbwrapper_2 */
}

static void OnStoreContextRequest_mbwrapper(void *nvm, uint32_t nvm_size)
{
  /* USER CODE BEGIN OnStoreContextRequest_mbwrapper_1 */

  /* USER CODE END OnStoreContextRequest_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_STORE_CONTEXT_REQ_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = (uint32_t)nvm;
  com_buffer[1] = nvm_size;
  com_obj->ParamCnt = 2;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnStoreContextRequest_mbwrapper_2 */

  /* USER CODE END OnStoreContextRequest_mbwrapper_2 */
}

static void OnNvmDataChange_mbwrapper(LmHandlerNvmContextStates_t state)
{
  /* USER CODE BEGIN OnNvmDataChange_mbwrapper_1 */

  /* USER CODE END OnNvmDataChange_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_NVM_DATA_CHANGE_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = (uint32_t)state;
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnNvmDataChange_mbwrapper_2 */

