STMicroelectronics/STM32CubeWL/Projects/B-WL5M-SUBG1/Applications/LoRaWAN_FUOTA_DualCore_ExtFlash/LoRaWAN_End_Node_DualCore/CM0PLUS/MbMux/LmHandler_mbwrapper.c
  /* USER CODE END OnNvmDataChange_mbwrapper_2 */
}

static void OnNetworkParametersChange_mbwrapper(CommissioningParams_t *params)
{
  /* USER CODE BEGIN OnNetworkParametersChange_mbwrapper_1 */

  /* USER CODE END OnNetworkParametersChange_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  if (params != NULL)
  {
    UTIL_MEM_cpy_8(aLoraMbWrapShare2Buffer, params, sizeof(CommissioningParams_t));
  }

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_NETWORK_PARAMS_CHANGE_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  if (params == NULL)
  {
    com_buffer[0] = (uint32_t)NULL;
  }
  else
  {
    com_buffer[0] = (uint32_t) aLoraMbWrapShare2Buffer;
  }
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnNetworkParametersChange_mbwrapper_2 */

  /* USER CODE END OnNetworkParametersChange_mbwrapper_2 */
}

static void OnJoinRequest_mbwrapper(LmHandlerJoinParams_t *joinParams)
{
  /* USER CODE BEGIN OnJoinRequest_mbwrapper_1 */

  /* USER CODE END OnJoinRequest_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;
  uint32_t next_addr = 0;

  if (joinParams != NULL)
  {
    UTIL_MEM_cpy_8(aLoraMbWrapShare2Buffer, joinParams, sizeof(LmHandlerJoinParams_t));
    /* need to 8-align the next address */
    next_addr += ALIGN_X(sizeof(LmHandlerJoinParams_t), 8);
    if (joinParams->CommissioningParams != NULL)
    {
      UTIL_MEM_cpy_8(&aLoraMbWrapShare2Buffer[next_addr], joinParams->CommissioningParams, sizeof(CommissioningParams_t));
      ((LmHandlerJoinParams_t *)aLoraMbWrapShare2Buffer)->CommissioningParams = (CommissioningParams_t *)&aLoraMbWrapShare2Buffer[next_addr];
    }
  }

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_JOIN_REQ_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  if (joinParams == NULL)
  {
    com_buffer[0] = (uint32_t)NULL;
  }
  else
  {
    com_buffer[0] = (uint32_t) aLoraMbWrapShare2Buffer;
  }
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnJoinRequest_mbwrapper_2 */

  /* USER CODE END OnJoinRequest_mbwrapper_2 */
}

static void OnTxData_mbwrapper(LmHandlerTxParams_t *params)
{
  /* USER CODE BEGIN OnTxData_mbwrapper_1 */

  /* USER CODE END OnTxData_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;
  uint32_t next_addr = 0;

  if (params != NULL)
  {
    UTIL_MEM_cpy_8(aLoraMbWrapShare2Buffer, params, sizeof(LmHandlerTxParams_t));
    /* need to 8-align the next address */
    next_addr += ALIGN_X(sizeof(LmHandlerTxParams_t), 8);
    if (params->CommissioningParams != NULL)
    {
      UTIL_MEM_cpy_8(&aLoraMbWrapShare2Buffer[next_addr], params->CommissioningParams, sizeof(CommissioningParams_t));
      ((LmHandlerTxParams_t *)aLoraMbWrapShare2Buffer)->CommissioningParams = (CommissioningParams_t *)&aLoraMbWrapShare2Buffer[next_addr];
    }
  }

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_TX_DATA_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);

  if (params == NULL)
  {
    com_buffer[0] = (uint32_t)NULL;
  }
  else
  {
    com_buffer[0] = (uint32_t) aLoraMbWrapShare2Buffer;
  }

  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnTxData_mbwrapper_2 */

  /* USER CODE END OnTxData_mbwrapper_2 */
}

static void OnRxData_mbwrapper(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_mbwrapper_1 */

  /* USER CODE END OnRxData_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;
  uint32_t next_addr = 0;
  uint32_t param_addr = 0;

  if (appData != NULL)
  {
    UTIL_MEM_cpy_8(aLoraMbWrapShare2Buffer, appData, sizeof(LmHandlerAppData_t));
    /* need to 8-align the next address */
    next_addr += ALIGN_X(sizeof(LmHandlerAppData_t), 8);

    if (appData->BufferSize > 0)
    {
      UTIL_MEM_cpy_8(&aLoraMbWrapShare2Buffer[next_addr], appData->Buffer, appData->BufferSize);
      ((LmHandlerAppData_t *)aLoraMbWrapShare2Buffer)->Buffer = &aLoraMbWrapShare2Buffer[next_addr];
      /* need to 8-align the next address */
      next_addr += ALIGN_X(appData->BufferSize, 8);
    }
  }

  if (params != NULL)
  {
    UTIL_MEM_cpy_8(&aLoraMbWrapShare2Buffer[next_addr], params, sizeof(LmHandlerRxParams_t));
    param_addr = next_addr;
    /* need to 8-align the next address */
    next_addr += ALIGN_X(sizeof(CommissioningParams_t), 8);
    if (params->CommissioningParams != NULL)
    {
      UTIL_MEM_cpy_8(&aLoraMbWrapShare2Buffer[next_addr], params->CommissioningParams, sizeof(CommissioningParams_t));
      ((LmHandlerRxParams_t *)&aLoraMbWrapShare2Buffer[param_addr])->CommissioningParams = (CommissioningParams_t *)&aLoraMbWrapShare2Buffer[next_addr];
    }
  }

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_RX_DATA_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  if (appData == NULL)
  {
    com_buffer[0] = (uint32_t)NULL;
  }
  else
  {
    com_buffer[0] = (uint32_t) aLoraMbWrapShare2Buffer;
  }

  if (params == NULL)
  {
    com_buffer[1] = (uint32_t)NULL;
  }
  else
  {
    com_buffer[1] = (uint32_t) &aLoraMbWrapShare2Buffer[param_addr];
  }

  com_obj->ParamCnt = 2;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnRxData_mbwrapper_2 */

  /* USER CODE END OnRxData_mbwrapper_2 */
}

static void OnClassChange_mbwrapper(DeviceClass_t deviceClass)
{
  /* USER CODE BEGIN OnClassChange_mbwrapper_1 */

  /* USER CODE END OnClassChange_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_CLASS_CHANGE_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = (uint32_t)deviceClass;
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnClassChange_mbwrapper_2 */

  /* USER CODE END OnClassChange_mbwrapper_2 */
}

static void OnBeaconStatusChange_mbwrapper(LmHandlerBeaconParams_t *params)
{
  /* USER CODE BEGIN OnBeaconStatusChange_mbwrapper_1 */

  /* USER CODE END OnBeaconStatusChange_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  if (params != NULL)
  {
    UTIL_MEM_cpy_8(aLoraMbWrapShare2Buffer, params, sizeof(LmHandlerBeaconParams_t));
  }

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_BEACON_STATUS_CHANGE_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  if (params == NULL)
  {
    com_buffer[0] = (uint32_t)NULL;
  }
  else
  {
    com_buffer[0] = (uint32_t) aLoraMbWrapShare2Buffer;
  }
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnBeaconStatusChange_mbwrapper_2 */

