STMicroelectronics/STM32CubeWL/Projects/B-WL5M-SUBG1/Applications/LoRaWAN_FUOTA_DualCore_ExtFlash/LoRaWAN_End_Node_DualCore/CM0PLUS/MbMux/LmHandler_mbwrapper.c
  /* USER CODE END OnBeaconStatusChange_mbwrapper_2 */
}

static void OnSysTimeUpdate_mbwrapper(void)
{
  /* USER CODE BEGIN OnSysTimeUpdate_mbwrapper_1 */

  /* USER CODE END OnSysTimeUpdate_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_SYS_TIME_UPDATE_CB_ID;
  com_obj->ParamCnt = 0;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnSysTimeUpdate_mbwrapper_2 */

  /* USER CODE END OnSysTimeUpdate_mbwrapper_2 */
}

static void OnTxPeriodicityChanged_mbwrapper(uint32_t periodicity)
{
  /* USER CODE BEGIN OnTxPeriodicityChanged_mbwrapper_1 */

  /* USER CODE END OnTxPeriodicityChanged_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_TX_PERIOD_CHANGED_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = periodicity;
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnTxPeriodicityChanged_mbwrapper_2 */

  /* USER CODE END OnTxPeriodicityChanged_mbwrapper_2 */
}

static void OnTxFrameCtrlChanged_mbwrapper(LmHandlerMsgTypes_t isTxConfirmed)
{
  /* USER CODE BEGIN OnTxFrameCtrlChanged_mbwrapper_1 */

  /* USER CODE END OnTxFrameCtrlChanged_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_TX_CTRL_CHANGED_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = (uint32_t)isTxConfirmed;
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnTxFrameCtrlChanged_mbwrapper_2 */

  /* USER CODE END OnTxFrameCtrlChanged_mbwrapper_2 */
}
static void OnPingSlotPeriodicityChanged_mbwrapper(uint8_t pingSlotPeriodicity)
{
  /* USER CODE BEGIN OnPingSlotPeriodicityChanged_mbwrapper_1 */

  /* USER CODE END OnPingSlotPeriodicityChanged_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;
  uint32_t *com_buffer = NULL;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_PING_SLOT_PERIOD_CHANGED_CB_ID;

  com_buffer = MBMUX_SEC_VerifySramBufferPtr(com_obj->ParamBuf, com_obj->BufSize);
  com_buffer[0] = (uint32_t)pingSlotPeriodicity;
  com_obj->ParamCnt = 1;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnPingSlotPeriodicityChanged_mbwrapper_2 */

  /* USER CODE END OnPingSlotPeriodicityChanged_mbwrapper_2 */
}

static void OnSystemReset_mbwrapper(void)
{
  /* USER CODE BEGIN OnSystemReset_mbwrapper_1 */

  /* USER CODE END OnSystemReset_mbwrapper_1 */
  MBMUX_ComParam_t *com_obj;

  com_obj = MBMUXIF_GetLoraFeatureNotifComPtr();
  com_obj->MsgId = LMHANDLER_ON_SYSTEM_RESET_CB_ID;
  com_obj->ParamCnt = 0;

  MBMUXIF_LoraSendNotif();
  /* waiting for event */
  /* once event is received and semaphore released: */
  return;
  /* USER CODE BEGIN OnSystemReset_mbwrapper_2 */

  /* USER CODE END OnSystemReset_mbwrapper_2 */
}

/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */
